wisteria-1c/Конфигурация/InformationRegisters/ПравилаМаршрутизацииЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПравилаМаршрутизацииЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыСогласованияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоказателейЗаявкиНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеДляСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходДСПлан</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ПравилаМаршрутизацииЗаявок/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыОткрытия = Новый Структура;
	
	ВыделенныеСтроки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если ВыделенныеСтроки.Количество() = 1 Тогда
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделенныеСтроки[0]);
		
		ПараметрыОткрытия.Вставить("Маршрут", Неопределено);
		ПараметрыОткрытия.Вставить("ВидПоказателя", Неопределено);
		
		ДанныеСтроки.Свойство("Маршрут", ПараметрыОткрытия.Маршрут);
		ДанныеСтроки.Свойство("ВидПоказателя", ПараметрыОткрытия.ВидПоказателя);
		
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ПравилаМаршрутизацииЗаявок.Форма.ФормаЗаписи", ПараметрыОткрытия);
	
КонецПроцедуры

 #КонецОбласти
